# **Условия задач:**
- ## **task 2**:

Вы разрабатываете интерактивный учебник по математике для 7 класса: работаете над заданиями к главе по теме «Площадь треугольника». 
Напишите программу, которая по заданным длинам сторон треугольника определяет, существует ли треугольник и, если да, вычисляет его площадь по формуле Герона. Формула Герона задана в прекоде.
Если треугольник не существует, выведите «Не существует», если существует, выведите площадь с точностью до двух знаков после запятой. Треугольник существует, если сумма любых двух его сторон строго больше третьей стороны.

- **Формат ввода:**

Строка из трех положительных чисел a, b и c (1 <= a, b, c <= 1000), разделенных пробелом — это длины сторон треугольника. Длины идут в произвольном порядке.

- **Формат вывода:**

Либо одна фраза «Не существует», либо площадь треугольника, округленная до двух знаков после запятой там, где это необходимо.

**_Пример 1:_**   
1. Входные данные:  23 11 13  
2. Выходные данные: 39.27

_**Пример 2:**_
1. Входные данные:   10 24 26
2. Выходные данные:  120

**_Пример 3:_**
1. Входные данные:  1 1 2
2. Выходные данные: Не существует

- **_Схема:_**

def classify_triangle(input_string: str)-> str:   
    p = (a + b + c) / 2  
    area = (p * (p - a) * (p - b) * (p - c)) ** 0.5
    """Ваш код"""

input_string = input()  
result = classify_triangle(input_string)   
print(result)


## task 3:
Вы разрабатываете программу для анализа текста.
Ваша задача — подсчитать количество уникальных слов в тексте.
Словом считается непрерывный набор буквенных символов. 
Разное написание одного и того же слова можно игнорировать, то есть «язык» и «языков» будут считаться разными словами.
Однако регистр нужно учитывать: «язык» и «Язык» должны считаться одним словом.


**Формат ввода**

Одна строка, содержащая текст.
Текст содержит буквенные символы, разделенные пробелами и знаками препинания.
Возможные знаки препинания заданы в прекоде.

**Формат вывода**

Одно число — количество уникальных слов.

- _**Пример 1:**_   
1) **Входные данные:**      
Привет, мир! Привет всем. Как тебя зовут? Меня зовут Тест. Привет, Тест!   

2) **Выходные данные:** 
 8

- _**Пример 2:**_   
1) **Входные данные:**   
Завтра будет совещание. Не опоздай на совещание. Приготовлю завтра омлет. Завтра придет твой друг.
2) **Выходные данные:** 
11 

- **Пример 3**  
**Входные данные:** 
???!!!
**Выходные данные**:
0


**Схема:**

def solve(input_string: str) -> str:    
    punctuation = "!-,.?"       
    """Ваш код"""

input_string = input()      
result = solve(input_string)      
print(result)
